vk_token = 'ВСТАВИТЬ ТОКЕН ВК'
tg_token = 'ВСТАВИТЬ ТОКЕН ТГ'


ADM_PASSWORD = 'ВСТАВИТЬ ПАРОЛЬ ДЛЯ АДМИНКИ' # Пароль для получения админки

admin_login = 'ЛОГИН АДМИНА В СГО'
admin_password = 'ПАРОЛЬ'
admin_school = 'ШКОЛА'
admin_link = 'ССЫЛКА НА СГО'
admin_id = 'АЙДИ ВК'

lessons_and_their_reduction = { # Уроки и их сокращения
    'Информатика': 'Инф.',
    'Алгебра': 'Алгебра',
    'Химия': 'Химия',
    'Физика': 'Физика',
    'География': 'Геогр.',
    'Биология': 'Биол.',
    'Геометрия': 'Геом.',
    'Физическая культура': 'Физ-ра',
    'Основы безопасности жизнедеятельности': 'ОБЖ',
    'Музыка': 'Музыка',
    'Обществознание': 'Общество.',
    'История': 'История',
    'Родной русский язык 5-11': 'Родн.Рус. яз.',
    'Родная (русская) литература 5-9': 'Родн. лит-ра',
    'Иностранный язык (англ.язык)': 'Англ. яз.',
    'Технология': 'Техн.',
    'Русский язык': 'Рус. яз.',
    'Литература.': 'Литература',
}

lessons_and_their_smiles = { # Уроки и их смайлы
    'Информатика': '🖥',
    'Алгебра': '🧮',
    'Химия': '🧪',
    'Физика': '⚛',
    'География': '🌍',
    'Биология': '🌱',
    'Геометрия': '📈',
    'Физическая культура': '⚽',
    'Основы безопасности жизнедеятельности': '🚑',
    'Музыка': '🎹',
    'Обществознание': '👫',
    'История': '🏰',
    'Иностранный язык (англ.язык)': '🍔',
    'Технология/М': '🪓',
    'Литература.': '📚',
    'Литература': '📚'
}

days_and_their_variations = { # Дни и их вариации
    'Понедельник': [1, '1', 'понедельник', 'пн', 'понед', 'пон', 'пнд', 'пндл', 'пндлк', 'пндлкн', 'monday', 'gjytltkmybr', 'ьщтвфн'],
    'Вторник': [2, '2', 'вторник', 'вт', 'втор', 'втр', 'втрн', 'втрнк', 'втрнкт', 'втрнктн', 'tuesday', 'dnjhybr', 'егуывфн'],
    'Среда': [3, '3', 'среда', 'среду', 'ср', 'срд', 'срдя', 'срдян', 'wednesday', 'chtlf', 'цувтуывфн'],
    'Четверг': [4, '4', 'четверг', 'чт', 'чтв', 'чтвр', 'чтврг', 'чтвргн', 'thursday', 'xtndthu', 'ергкывфн'],
    'Пятница': [5, '5', 'пятница', 'пятницу', 'пт', 'пят', 'пятн', 'пятни', 'пятниц', 'friday', 'gznybwf', 'акшвфн'],
    'Суббота': [6, '6', 'суббота', 'субботу', 'сб', 'сбт', 'сбтб', 'saturday', 'ce,,jnf', 'ыфеуквфн']
}

weekDays = { # Дни недели
    0: 'Понедельник',
    1: 'Вторник',
    2: 'Среда',
    3: 'Четверг',
    4: 'Пятница',
    5: 'Суббота'
}